SoapTest/soap_config/8.change_cosp.txt

<?xml version="1.0" encoding="UTF-8"?>

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
<S:Body>

<SubmitRequest xmlns="http://alcatel-lucent.com/esm/ws/svcmgr/V2_0">
    <SessionInfo>
        <sessionId>173380</sessionId>
    </SessionInfo>

    <RequestInfo>
        <ReqID></ReqID>
    </RequestInfo>


    <TaskList>
        <Task>
            <Name>Change Class Of Service</Name>
            <ParamList>
                <Param>
                    <Name>Account ID</Name>
                    <Value>886906000019</Value>
                </Param>
               <Param>
                    <Name>Class of Service ID</Name>
                    <Value>P4G1510350</Value>
                </Param>
                <Param>
                    <Name>Transaction ID</Name>
                    <Value>MsgSoap008</Value>
                </Param>
            </ParamList>
        </Task>
    </TaskList>
</SubmitRequest>


</S:Body>
</S:Envelope>


